<?php
$lang['all'] = 'Искать везде';
$lang['desc_css_search'] = 'Поиск в таблицах стилей';
$lang['desc_content_search'] = 'Поиск на страницах контента';
$lang['desc_filter_all'] = 'Переключить все фильтры';
$lang['desc_oldmodtemplate_search'] = 'Поиск старых шаблонов модулей.';
$lang['desc_template_search'] = 'Поиск в шаблонах';
$lang['error_nosearchtext'] = 'Пожалуйста введите запрос для поиска';
$lang['error_select_slave'] = 'Вы должны выбрать хотя бы один тип фильтра';
$lang['filter'] = 'Фильтр';
$lang['finished'] = 'Поиск выполенен';
$lang['friendlyname'] = 'Поиск по CMS MS';
$lang['help'] = '<h3> Для чего этот модуль? </h3>
  <p> Этот модуль обеспечивает возможность быстрого поиска мест в шаблонах, страницах контента и другой базе данных, где встречается текстовая строка. Это особенно полезно для поиска смарт-тегов, имен классов, идентификаторов или других битов кода HTML, которые могут быть трудно найти на большом веб-сайте. </p>
  <p> Этот модуль не имеет взаимодействия с внешним интерфейсом, он предназначен для использования разработчиками или редакторами сайтов CMSMS для поиска подстроек текста или кода. Не для использования в поиске текста в интерфейсе веб-сайтов. </p>

<h3> Как использовать его </ h3>
  <p> Этот модуль доступен большинству администраторов веб-сайта с хотя бы некоторыми разрешениями для редактирования шаблонов, таблиц стилей или некоторого содержимого. Хотя список того, что можно найти, может быть уменьшен. </p>
  <p> Модуль предоставляет текстовое поле, в котором может быть введена одна строка (строка не делится на слова или иначе анализируется). Он также предоставляет возможность поиска только определенных подразделов веб-сайта. </p>
  <p> Поиск будет генерировать вложенный, расширяемый список разделов, в которых были найдены совпадения. В каждом разделе отображается описание совпадения. Обычно со ссылкой, которая направит вас к форме для редактирования элемента. </p>

<h3> Поддержка </h3>
<p> В соответствии с GPL это программное обеспечение предоставляется как есть. Пожалуйста, прочитайте текст лицензии для полного отказа от ответственности. </ P>

<h3>Copyright and License</h3>
<p>Copyright &copy; 2012, calguy1000 <a href=&quot;mailto:calguy1000@hotmail.com&quot;>&lt;calguy1000@hotmail.com&gt;</a>. All Rights Are Reserved.</p>
<p> Этот модуль был выпущен в <a href=&quot;http://www.gnu.org/licenses/licenses.html#GPL&quot;>GNU Public License</a>. Вы должны согласиться с этой лицензией перед использованием модуля. </ P>';
$lang['lbl_content_search'] = 'Поиск страниц контента';
$lang['lbl_css_search'] = 'Поиск стилей';
$lang['lbl_gcb_search'] = 'Поиск глобальных блоков контента';
$lang['lbl_oldmodtemplate_search'] = 'Поиск шаблонов модулей';
$lang['lbl_search_desc'] = 'Искать в описании <em>(если применимо)</em>';
$lang['lbl_template_search'] = 'Поиск шаблона';
$lang['moddescription'] = 'Утилита для поиска таблиц базы данных для строк, содержащих определенный текст. Полезно для поиска, где используются определенные стили, теги или модули.';
$lang['placeholder_search_text'] = 'Введите текст поиска';
$lang['postinstall'] = 'Установлен модуль поиска по CMS MS';
$lang['postuninstall'] = 'Удален модуль поиска по CMS MS';
$lang['search'] = 'Поиск';
$lang['search_text'] = 'Поисковой запрос';
$lang['search_results'] = 'Результаты поиска';
$lang['sectiondesc_oldmodtemplates'] = 'Результаты в этом разделе не доступны для кликов, так как каждый модуль предоставляет свой собственный интерфейс панели администратора для редактирования шаблонов';
$lang['settings'] = 'Настройки';
$lang['starting'] = 'Начало поиска';
$lang['warn_clickthru'] = 'Это действие откроет другое окно. Отмена из этого окна может не вернуть вас на эту страницу. Результаты поиска могут быть потеряны.';
?>