<?php
$lang['all'] = 'Всі';
$lang['desc_css_search'] = 'Пошук відповідного тексту в таблицях стилів';
$lang['desc_content_search'] = 'Пошук відповідного тексту на сторінках';
$lang['desc_filter_all'] = 'Перемкнути всі фільтри';
$lang['desc_oldmodtemplate_search'] = 'Пошук старих шаблонів модулів.';
$lang['desc_template_search'] = 'Пошук відповідного тексту в шаблонах';
$lang['error_nosearchtext'] = 'Будь ласка, введіть пошуковий термін';
$lang['error_select_slave'] = 'Ви повинні вибрати принаймні один тип фільтра';
$lang['filter'] = 'Фільтр';
$lang['finished'] = 'Готово';
$lang['friendlyname'] = 'Пошук по адмін. панелі';
$lang['help'] = '<h3>Що робить цей модуль?</h3>
   <p>Цей модуль надає можливість швидко знаходити місця у шаблонах, на сторінках та інших базах даних, де зустрічаються текстові рядки. Це особливо корисно для пошуку Smarty теґів, назв класів, id чи інших частин HTML-коду, які важко знайти на великому веб-сайті.</p>
   <p>Цей модуль не має взаємодії з фронтендом, він призначений для використання розробниками або редакторами веб-сайтів CMSMS для пошуку підрядків тексту або коду. Не для пошуку тексту на фронтенді веб-сайтів.</p>

<h3>Як використовувати його</h3>
   <p>Цей модуль є видимим для більшості адміністраторів веб-сайту з принаймні деякими правами на редагування шаблонів, таблиць стилів чи деякого вмісту. Хоча список того, що можна шукати, може бути зменшений.</p>
   <p>Модуль надає текстове поле, в якому можна ввести окремий рядок (рядок не ділиться на слова та не розбивається іншим чином). Він також забезпечує можливість пошуку лише певних підрозділів веб-сайту.</p>
   <p> Пошук згенерує список розділів з підпунктами, які відповідають пошуковому запиту. Під кожним розділом відображається опис знайденого. Зазвичай з посиланням, що спрямовує вас до форми для редагування елемента.</p>

<h3>Підтримка</h3>
<p>Згідно з GPL, це програмне забезпечення надається як є. Будь ласка, прочитайте текст ліцензії.</p>

<h3>Авторське право та ліцензія</h3>
<p>Авторське право і копіювання; 2012, calguy1000 <a href="mailto:calguy1000@hotmail.com"><calguy1000@hotmail.com></a>. Всі права захищені.</p>
<p>Цей модуль був випущений під ліцензією <a href="http://www.gnu.org/licenses/licenses.html#GPL">GNU Public License</a>. Ви повинні погодитися з ліцензією перед використанням модуля.</p>';
$lang['lbl_content_search'] = 'Пошук сторінок';
$lang['lbl_css_search'] = 'Пошук таблиць стилів';
$lang['lbl_gcb_search'] = 'Пошук глобальних блоків вмісту';
$lang['lbl_oldmodtemplate_search'] = 'Пошук шаблонів модулів';
$lang['lbl_search_desc'] = 'Короткі описи <em>(де можливо)</em>';
$lang['lbl_template_search'] = 'Пошук шаблонів';
$lang['moddescription'] = 'Утиліта для пошуку в таблицях баз даних рядків, що містять певний текст. Вона знаходить, де використовуються певні стилі, теги чи модулі.';
$lang['placeholder_search_text'] = 'Введіть текст пошуку';
$lang['postinstall'] = 'Модуль пошуку по адмін. панелі встановлено';
$lang['postuninstall'] = 'Модуль пошуку по адмін. панелі видалено';
$lang['search'] = 'Пошук';
$lang['search_text'] = 'Текст пошуку';
$lang['search_results'] = 'Результати пошуку';
$lang['sectiondesc_oldmodtemplates'] = 'Результати в цьому розділі не можна натискати, оскільки кожен модуль надає власний інтерфейс адмін. панелі для редагування шаблонів';
$lang['settings'] = 'Налаштування';
$lang['starting'] = 'Запуск';
$lang['warn_clickthru'] = 'Це відкриє інше вікно. Скасування з цього вікна може не повернути вас на цю сторінку. Результати пошуку можуть бути втрачені.';
?>