<?php
$lang['created'] = 'Створено';
$lang['errors'] = 'Помилки';
$lang['evtdesc_CmsJobManager::OnJobFailed'] = 'Відправлено після того, як завдання видалено з черги після багаторазового невиконання';
$lang['evthelp_CmsJobManager::OnJobFailed'] = '<h4>Параметри:</h4>
<ul>
  <li>"job" - Посилання на об\'єкт \\CMSMS\\Async\\Job, який не вдалося виконати</li>
</ul>';
$lang['frequency'] = 'Частота';
$lang['friendlyname'] = 'Фоновий менеджер завдань';
$lang['info_background_jobs'] = 'Ця панель містить інформацію про всі відомі фонові завдання. Звичайно, завдання часто з\'являються і зникають у цьому списку. Якщо завдання має високий показник кількості помилок або взагалі не починалося, це може означати, що вам потрібно вивчити причини цієї помилки.';
$lang['info_no_jobs'] = 'Наразі немає завдань в черзі';
$lang['jobs'] = 'Завдання';
$lang['moddescription'] = 'Модуль для керування завданнями асинхронної обробки.';
$lang['module'] = 'Модуль';
$lang['name'] = 'Ім\'я';
$lang['processing_freq'] = 'Максимальна частота обробки (в секундах)';
$lang['recur_120m'] = 'Кожні 2 години';
$lang['recur_15m'] = 'Кожні 15 хвилин';
$lang['recur_180m'] = 'Кожні 3 години';
$lang['recur_30m'] = 'Кожні 30 хвилин';
$lang['recur_daily'] = 'Щоденно';
$lang['recur_hourly'] = 'Щогодинно';
$lang['recur_monthly'] = 'Щомісячно';
$lang['recur_weekly'] = 'Щотижнево';
$lang['settings'] = 'Налаштування';
$lang['start'] = 'Почати';
$lang['until'] = 'До';
$lang['help'] = '<h3>Дія:</h3>
<p>Це основний модуль CMSMS, який забезпечує функціональність обробки завдань асинхронно (у фоновому режимі), в той час як веб-сайт обробляє запити.</p>
<p>CMSMS та сторонні модулі можуть створювати завдання для виконання проектів, які не потребують безпосереднього втручання користувача або які можуть потребувати деякий час для обробки. Цей модуль надає можливість обробки таких завдань.</p>
<h3>Використання:</h3>
<p> Цей модуль не має власної взаємодії. Він забезпечує простий звіт завдань, що містить списки завдань, які менеджер наразі має у своїй черзі. Завдання можуть регулярно включатися до цієї черги та виключатися з неї, так що оновлення сторінки час від часу може вказувати вам, що відбувається у фоні вашого сайту.</p>
<p>Цей модуль оброблятиме завдання лише максимум кожну хвилину та щонайменше кожні десять хвилин. Хоча за умовчанням це значення становить 3 хвилини. Така нечаста обробка полягає в тому, щоб забезпечити розумну продуктивність на більшості веб-сайтів.</p>
<p> Ви можете налаштувати частоту, додавши змінну cmsjobmgr_asyncfreq у файл config.php для вашого сайту, що містить ціле значення від 0 до 10.</p>
<pre>i.e: <code>$config["cmsjobmgr_asyncfreq"] = 5;</code>.</pre>
<p><strong>Примітка:</strong> Неможливо повністю вимкнути асинхронну обробку. Це пов\'язано з тим, що деякі функції сервера CMSMS базується на цій функції.</p>
<h3>Забезпечення обробки фону.</h3>
<p> На деяких сайтах з низьким попитом, де вхідні запити можуть з\'являтися не часто, але ви хочете переконатися в тому, що відбувається фонове оформлення, ми рекомендуємо встановити завдання cron на регулярний запит (через кожні 3 - 5 хвилин), для URL-адреси на сайті. Це може бути проста сторінка без вмісту, яка не відображається в меню. тобто:</p>
<pre>*/3 * * * * wget -O /dev/null https://www.mysite.com/</pre>
<h3>Що стосується проблемних завдань.</h3>
<p> Час від часу деякі програми можуть створювати завдання, які не вдається виконати через якісь помилки. CmsJobManager буде видаляти завдання з черги після багаторазового його невиконання. У той час вихідний код може відновити роботу. Якщо ви зіткнулися з проблемним завданням, яке продовжує не виконуватися, це помилка, яку треба діагностувати і детально повідомити про неї відповідних розробників.</p>';
?>